JayHeng/imxrt-tool-flash-algo/boards/rt600_emmc_project/flash_algo_b0_silicon/Keil_JLink/emmc/fsl_sdmmc_host.h
/*! @brief card detect callback definition */
typedef void (*sdmmchost_cd_callback_t)(bool isInserted, void *userData);

/*! @brief host Endian mode
 * corresponding to driver define
 */
enum _sdmmchost_endian_mode
{
    kSDMMCHOST_EndianModeBig = 0U,         /*!< Big endian mode */
    kSDMMCHOST_EndianModeHalfWordBig = 1U, /*!< Half word big endian mode */
    kSDMMCHOST_EndianModeLittle = 2U,      /*!< Little endian mode */
};

/*! @brief sd card detect type */
typedef enum _sdmmchost_detect_card_type
{
    kSDMMCHOST_DetectCardByGpioCD,    /*!< sd card detect by CD pin through GPIO */
    kSDMMCHOST_DetectCardByHostCD,    /*!< sd card detect by CD pin through host */
    kSDMMCHOST_DetectCardByHostDATA3, /*!< sd card detect by DAT3 pin through host */
} sdmmchost_detect_card_type_t;

/*! @brief sd card detect */
typedef struct _sdmmchost_detect_card
{
    sdmmchost_detect_card_type_t cdType; /*!< card detect type */
    uint32_t cdTimeOut_ms; /*!< card detect timeout which allow 0 - 0xFFFFFFF, value 0 will return immediately, value
          0xFFFFFFFF will block until card is insert */

    sdmmchost_cd_callback_t cardInserted; /*!< card inserted callback which is meaningful for interrupt case */
    sdmmchost_cd_callback_t cardRemoved;  /*!< card removed callback which is meaningful for interrupt case */

    void *userData; /*!< user data */
} sdmmchost_detect_card_t;

/*! @brief card power control function pointer */
typedef void (*sdmmchost_pwr_t)(void);

/*! @brief card power control */
typedef struct _sdmmchost_pwr_card
{
    sdmmchost_pwr_t powerOn;  /*!< power on function pointer */
    uint32_t powerOnDelay_ms; /*!< power on delay */

    sdmmchost_pwr_t powerOff;  /*!< power off function pointer */
    uint32_t powerOffDelay_ms; /*!< power off delay */
} sdmmchost_pwr_card_t;

/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C"
{
#endif

    /*!
     * @name adaptor function
     * @{
     */

    /*!
     * @brief host not support function, this function is used for host not support feature
     * @param  void parameter ,used to avoid build warning
     * @retval kStatus_Fail ,host do not suppport
     */
    static inline status_t SDMMCHOST_NotSupport(void *parameter)
    {
        parameter = parameter;
        return kStatus_Success;
    }

    /*!
     * @brief Detect card insert, only need for SD cases.
     * @param base the pointer to host base address
     * @param cd card detect configuration
     * @param waitCardStatus status which user want to wait
     * @retval kStatus_Success detect card insert
     * @retval kStatus_Fail card insert event fail
     */
    status_t SDMMCHOST_WaitCardDetectStatus(SDMMCHOST_TYPE *hostBase,
                                            const sdmmchost_detect_card_t *cd,
                                            bool waitCardStatus);

    /*!
     * @brief Check card is present or not., only used for ROM
     * @param base the pointer to host base address
     * @param card detect configuration
     * @retval true card is present
     * @retval false card is not present
     */
    bool SDMMCHOST_BL_IsCardPresent(SDMMCHOST_TYPE *base, const sdmmchost_detect_card_type_t cdType);

    /*!
     * @brief check card is present or not.
     * @retval true card is present
     * @retval false card is not present
     */
    bool SDMMCHOST_IsCardPresent(void);

    /*!
     * @brief Init host controller.
     * @param host the pointer to host structure in card structure.
     * @param userData specific user data
     * @retval kStatus_Success host init success
     * @retval kStatus_Fail event fail
     */
    status_t SDMMCHOST_Init(SDMMCHOST_CONFIG *host, void *userData);

    /*!
     * @brief reset host controller.
     * @param host base address.
     */
    void SDMMCHOST_Reset(SDMMCHOST_TYPE *base);

    /*!
     * @brief Deinit host controller.
     * @param host the pointer to host structure in card structure.
     */
    void SDMMCHOST_Deinit(void *host);

    /*!
     * @brief host power off card function.
     * @param base host base address.
     * @param pwr depend on user define power configuration.
     */
    void SDMMCHOST_PowerOffCard(SDMMCHOST_TYPE *base, const sdmmchost_pwr_card_t *pwr);

    /*!
     * @brief host power on card function.
     * @param base host base address.
     * @param pwr depend on user define power configuration.
     */
    void SDMMCHOST_PowerOnCard(SDMMCHOST_TYPE *base, const sdmmchost_pwr_card_t *pwr);

    /*!
     * @brief SDMMC host delay function.
     * @param milliseconds delay counter.
     */
    void SDMMCHOST_Delay(uint32_t milliseconds);

    /* @} */

#if defined(__cplusplus)
}
#endif

#endif /* _FSL_SDMMC_HOST_H */
